{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "3c1add80-8d9e-4b8a-a072-69347b7b08a3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "(No data)"
      ],
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 删除所有 'within' 关系\n",
    "g.run(\"MATCH ()-[r:within]->() DELETE r\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "f2a5ed1f-4345-4a04-b0d7-d4b1e9a8a973",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>touch_relation_count</th></tr><tr><td style=\"text-align:right\">0</td></tr></table>"
      ],
      "text/plain": [
       " touch_relation_count \n",
       "----------------------\n",
       "                    0 "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = 'MATCH ()-[r:within]->() RETURN count(r) AS touch_relation_count'\n",
    "g.run(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "57e02828-424f-431d-97a1-c35758dd2d32",
   "metadata": {},
   "outputs": [],
   "source": [
    "global_var = 100000000000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "330fc1d5-9c02-47e9-a5c0-73b40aa68bfc",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "PROJ: proj_create_from_database: Cannot find proj.db\n"
     ]
    }
   ],
   "source": [
    "import geopandas as gpd\n",
    "from shapely import geometry\n",
    "import matplotlib.pyplot as plt\n",
    "import pandas as pd\n",
    "\n",
    "road = r\"F:/paper2/result/split_result.shp\"\n",
    "road = gpd.read_file(road)\n",
    "honey = r\"F:\\paper2\\result\\dz_honeycomb_125.shp\"\n",
    "honey = gpd.read_file(honey)\n",
    "\n",
    "# fig, ax = plt.subplots(figsize=(12, 8))\n",
    "# ax = road.geometry.plot(ax=ax,fc='none',ec='k')\n",
    "# ax = honey.geometry.plot(ax=ax)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "9d7771ec-88b1-420e-8447-85014c937cc6",
   "metadata": {},
   "outputs": [],
   "source": [
    "#显示所有列\n",
    "pd.set_option('display.max_columns', None)\n",
    "pd.set_option('max_colwidth',200)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "be69dab4-39d0-42d9-b198-bf91e2db9c3b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Node, Relationship, Graph, NodeMatcher, RelationshipMatcher, Subgraph\n",
    "import os\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "cf3c1d98-bc90-4c2f-bfa7-605d0ca9984f",
   "metadata": {},
   "outputs": [],
   "source": [
    "g = Graph('bolt://localhost:7687',auth=('neo4j','your password'), name = 'trkg')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "0b96e841-375e-4a7e-8ff5-872c493fc7e0",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>FID</th>\n",
       "      <th>geometry</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>POLYGON ((607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>POLYGON ((607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>POLYGON ((607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>POLYGON ((607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>POLYGON ((607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204006</th>\n",
       "      <td>204006</td>\n",
       "      <td>POLYGON ((621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204007</th>\n",
       "      <td>204007</td>\n",
       "      <td>POLYGON ((621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204008</th>\n",
       "      <td>204008</td>\n",
       "      <td>POLYGON ((621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204009</th>\n",
       "      <td>204009</td>\n",
       "      <td>POLYGON ((619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204010</th>\n",
       "      <td>204010</td>\n",
       "      <td>POLYGON ((620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>204011 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "           FID  \\\n",
       "0            0   \n",
       "1            1   \n",
       "2            2   \n",
       "3            3   \n",
       "4            4   \n",
       "...        ...   \n",
       "204006  204006   \n",
       "204007  204007   \n",
       "204008  204008   \n",
       "204009  204009   \n",
       "204010  204010   \n",
       "\n",
       "                                                                                                                                                                                                       geometry  \n",
       "0       POLYGON ((607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167...  \n",
       "1       POLYGON ((607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167.775, 607833.096 3407167...  \n",
       "2       POLYGON ((607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292.775, 607616.590 3407292...  \n",
       "3       POLYGON ((607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355.275, 607508.337 3407355...  \n",
       "4       POLYGON ((607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480.275, 607508.337 3407480...  \n",
       "...                                                                                                                                                                                                         ...  \n",
       "204006  POLYGON ((621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917.775, 621256.490 3527917...  \n",
       "204007  POLYGON ((621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917.775, 621039.984 3527917...  \n",
       "204008  POLYGON ((621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105.275, 621148.237 3528105...  \n",
       "204009  POLYGON ((619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542.775, 619957.452 3527542...  \n",
       "204010  POLYGON ((620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730.275, 620282.211 3527730...  \n",
       "\n",
       "[204011 rows x 2 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "honeybuffer = r\"F:/paper2/result/honeybuffer_125.shp\"\n",
    "honeybuffer = gpd.read_file(honeybuffer)\n",
    "honeybuffer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "8bc377e2-dade-4835-a486-d6a2a7fbe8ad",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pre_code</th>\n",
       "      <th>fclass</th>\n",
       "      <th>name</th>\n",
       "      <th>layer</th>\n",
       "      <th>oneway</th>\n",
       "      <th>bridge</th>\n",
       "      <th>tunnel</th>\n",
       "      <th>fclass中</th>\n",
       "      <th>描述</th>\n",
       "      <th>分类</th>\n",
       "      <th>index</th>\n",
       "      <th>distance</th>\n",
       "      <th>geometry</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>38377</td>\n",
       "      <td>primary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>主要道路</td>\n",
       "      <td>城市主要车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>0</td>\n",
       "      <td>216.622015</td>\n",
       "      <td>LINESTRING (611188.945 3408186.854, 611405.451 3408179.776)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>8080</td>\n",
       "      <td>primary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>主要道路</td>\n",
       "      <td>城市主要车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>1</td>\n",
       "      <td>216.625870</td>\n",
       "      <td>LINESTRING (611405.451 3408191.808, 611188.945 3408199.003)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>38377</td>\n",
       "      <td>primary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>主要道路</td>\n",
       "      <td>城市主要车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>2</td>\n",
       "      <td>216.622015</td>\n",
       "      <td>LINESTRING (610972.438 3408193.932, 611188.945 3408186.854)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>8080</td>\n",
       "      <td>primary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>主要道路</td>\n",
       "      <td>城市主要车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>3</td>\n",
       "      <td>216.625870</td>\n",
       "      <td>LINESTRING (611188.945 3408199.003, 610972.438 3408206.198)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>38377</td>\n",
       "      <td>primary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>主要道路</td>\n",
       "      <td>城市主要车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>4</td>\n",
       "      <td>216.622015</td>\n",
       "      <td>LINESTRING (609889.906 3408229.322, 610106.413 3408222.244)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110541</th>\n",
       "      <td>29747</td>\n",
       "      <td>secondary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>B</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>次要道路</td>\n",
       "      <td>城市次要车行道路，机场外围车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>110541</td>\n",
       "      <td>217.761116</td>\n",
       "      <td>LINESTRING (621797.756 3524764.073, 622014.262 3524740.730)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110542</th>\n",
       "      <td>29747</td>\n",
       "      <td>secondary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>B</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>次要道路</td>\n",
       "      <td>城市次要车行道路，机场外围车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>110542</td>\n",
       "      <td>217.867493</td>\n",
       "      <td>LINESTRING (621364.743 3524812.515, 621581.249 3524788.199)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110543</th>\n",
       "      <td>29747</td>\n",
       "      <td>secondary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>B</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>次要道路</td>\n",
       "      <td>城市次要车行道路，机场外围车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>110543</td>\n",
       "      <td>217.846776</td>\n",
       "      <td>LINESTRING (621581.249 3524788.199, 621755.590 3524768.619, 621797.756 3524764.073)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110544</th>\n",
       "      <td>29747</td>\n",
       "      <td>secondary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>B</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>次要道路</td>\n",
       "      <td>城市次要车行道路，机场外围车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>110544</td>\n",
       "      <td>198.842111</td>\n",
       "      <td>LINESTRING (622014.262 3524740.730, 622211.958 3524719.415)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110545</th>\n",
       "      <td>29747</td>\n",
       "      <td>secondary</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>B</td>\n",
       "      <td>F</td>\n",
       "      <td>F</td>\n",
       "      <td>次要道路</td>\n",
       "      <td>城市次要车行道路，机场外围车行道路</td>\n",
       "      <td>城市主干路</td>\n",
       "      <td>110545</td>\n",
       "      <td>35.208790</td>\n",
       "      <td>LINESTRING (622531.897 3524681.418, 622545.074 3524678.845, 622566.312 3524674.001)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>110546 rows × 13 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       pre_code     fclass  name  layer oneway bridge tunnel fclass中  \\\n",
       "0         38377    primary  None    0.0      F      F      F    主要道路   \n",
       "1          8080    primary  None    0.0      F      F      F    主要道路   \n",
       "2         38377    primary  None    0.0      F      F      F    主要道路   \n",
       "3          8080    primary  None    0.0      F      F      F    主要道路   \n",
       "4         38377    primary  None    0.0      F      F      F    主要道路   \n",
       "...         ...        ...   ...    ...    ...    ...    ...     ...   \n",
       "110541    29747  secondary  None    0.0      B      F      F    次要道路   \n",
       "110542    29747  secondary  None    0.0      B      F      F    次要道路   \n",
       "110543    29747  secondary  None    0.0      B      F      F    次要道路   \n",
       "110544    29747  secondary  None    0.0      B      F      F    次要道路   \n",
       "110545    29747  secondary  None    0.0      B      F      F    次要道路   \n",
       "\n",
       "                       描述     分类   index    distance  \\\n",
       "0                城市主要车行道路  城市主干路       0  216.622015   \n",
       "1                城市主要车行道路  城市主干路       1  216.625870   \n",
       "2                城市主要车行道路  城市主干路       2  216.622015   \n",
       "3                城市主要车行道路  城市主干路       3  216.625870   \n",
       "4                城市主要车行道路  城市主干路       4  216.622015   \n",
       "...                   ...    ...     ...         ...   \n",
       "110541  城市次要车行道路，机场外围车行道路  城市主干路  110541  217.761116   \n",
       "110542  城市次要车行道路，机场外围车行道路  城市主干路  110542  217.867493   \n",
       "110543  城市次要车行道路，机场外围车行道路  城市主干路  110543  217.846776   \n",
       "110544  城市次要车行道路，机场外围车行道路  城市主干路  110544  198.842111   \n",
       "110545  城市次要车行道路，机场外围车行道路  城市主干路  110545   35.208790   \n",
       "\n",
       "                                                                                   geometry  \n",
       "0                               LINESTRING (611188.945 3408186.854, 611405.451 3408179.776)  \n",
       "1                               LINESTRING (611405.451 3408191.808, 611188.945 3408199.003)  \n",
       "2                               LINESTRING (610972.438 3408193.932, 611188.945 3408186.854)  \n",
       "3                               LINESTRING (611188.945 3408199.003, 610972.438 3408206.198)  \n",
       "4                               LINESTRING (609889.906 3408229.322, 610106.413 3408222.244)  \n",
       "...                                                                                     ...  \n",
       "110541                          LINESTRING (621797.756 3524764.073, 622014.262 3524740.730)  \n",
       "110542                          LINESTRING (621364.743 3524812.515, 621581.249 3524788.199)  \n",
       "110543  LINESTRING (621581.249 3524788.199, 621755.590 3524768.619, 621797.756 3524764.073)  \n",
       "110544                          LINESTRING (622014.262 3524740.730, 622211.958 3524719.415)  \n",
       "110545  LINESTRING (622531.897 3524681.418, 622545.074 3524678.845, 622566.312 3524674.001)  \n",
       "\n",
       "[110546 rows x 13 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "road"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "3268b5cd-5eff-4a1c-a45c-837e81783cb2",
   "metadata": {},
   "outputs": [],
   "source": [
    "node_matcher = NodeMatcher(g)\n",
    "relation_matcher = RelationshipMatcher(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "07dd0753-80e6-4e59-9fd2-f0272c3178f0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "f8d5a101052b42178cfffc4271d24b40",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Processing honeycomb-road relationships:   0%|          | 0/204011 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from tqdm.notebook import tqdm\n",
    "\n",
    "# 1. 初始化索引\n",
    "road_index = road.sindex  # 建立R树索引\n",
    "\n",
    "# 2. 逐个处理honeycomb节点并处理关系\n",
    "for i in tqdm(range(len(honeybuffer)), total=len(honeybuffer), desc=\"Processing honeycomb-road relationships\"):\n",
    "    if i >= global_var:\n",
    "        break\n",
    "\n",
    "    polygon = honeybuffer.loc[i, 'geometry']\n",
    "\n",
    "    # 通过R树进行简单包含查询\n",
    "    possible_matches_index = list(road_index.intersection(polygon.bounds))\n",
    "    possible_matches = road.iloc[possible_matches_index]\n",
    "\n",
    "    # 精确查询，匹配在多边形内部的道路\n",
    "    precise_matches_intersects = possible_matches[possible_matches.within(polygon)]\n",
    "\n",
    "    k = precise_matches_intersects['index'].tolist()\n",
    "\n",
    "    # 匹配知识图谱中的格网节点\n",
    "    main_honeycomb = node_matcher.match('honeycomb', name=i).first()\n",
    "\n",
    "    # 处理与当前 honeycomb 相交的道路节点\n",
    "    for j in k:\n",
    "        if j >= global_var:\n",
    "            break\n",
    "\n",
    "        sub_road = node_matcher.match('road', name=j).first()\n",
    "\n",
    "        # 使用 Cypher 的 MERGE 语句保证关系的唯一性\n",
    "        query = \"\"\"\n",
    "        MATCH (a:road {name: $sub}), (b:honeycomb {name: $main})\n",
    "        MERGE (a)-[r:within]->(b)\n",
    "        RETURN r\n",
    "        \"\"\"\n",
    "        g.run(query, main=main_honeycomb['name'], sub=sub_road['name'])\n",
    "\n",
    "# 3. 此时不再需要批量提交关系，Cypher 中的 MERGE 操作已经处理了唯一性问题\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "3991e87a-65dd-4e3a-b0c4-b43233ad0b7d",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "1374bdaf83bb4581bdb7ceb327f41cee",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Processing honeycomb-road relationships:   0%|          | 0/204011 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from concurrent.futures import ThreadPoolExecutor\n",
    "from tqdm.notebook import tqdm\n",
    "\n",
    "# 1. 定义处理函数 cross_relation_construction\n",
    "def cross_relation_construction(i):\n",
    "    if i >= global_var:\n",
    "        return []\n",
    "\n",
    "    polygon = honeybuffer.loc[i, 'geometry']\n",
    "\n",
    "    # 通过R树进行简单包含查询\n",
    "    possible_matches_index = list(road_index.intersection(polygon.bounds))\n",
    "    possible_matches = road.iloc[possible_matches_index]\n",
    "\n",
    "    # 精确查询，匹配在多边形内部的道路\n",
    "    precise_matches_intersects = possible_matches[possible_matches.within(polygon)]\n",
    "\n",
    "    k = precise_matches_intersects['index'].tolist()\n",
    "\n",
    "    # 匹配知识图谱中的格网节点\n",
    "    main_honeycomb = node_matcher.match('honeycomb', name=i).first()\n",
    "\n",
    "    relations = []\n",
    "    for j in k:\n",
    "        if j >= global_var:\n",
    "            continue\n",
    "\n",
    "        sub_road = node_matcher.match('road', name=j).first()\n",
    "\n",
    "        # 使用Cypher查询检查两个节点之间是否存在\"within\"关系\n",
    "        query = \"\"\"\n",
    "        MATCH (a:road {name: $sub})-[r:within]->(b:honeycomb {name: $main})\n",
    "        RETURN count(r) > 0 as relation_exists\n",
    "        \"\"\"\n",
    "        relation_exists = g.run(query, main=main_honeycomb['name'], sub=sub_road['name']).evaluate()\n",
    "\n",
    "        # 只有在不存在关系时，才创建 within 关系\n",
    "        if not relation_exists:\n",
    "            relation = Relationship(sub_road, \"within\", main_honeycomb)\n",
    "            relations.append(relation)\n",
    "\n",
    "    return relations\n",
    "\n",
    "# 2. 初始化索引\n",
    "relation_ls = []\n",
    "road_index = road.sindex  # 建立R树索引\n",
    "\n",
    "# 3. 使用ThreadPoolExecutor进行并行处理，并加上进度条\n",
    "with ThreadPoolExecutor(max_workers=120) as executor:  # 根据你的CPU核心数设置max_workers\n",
    "    for relations in tqdm(executor.map(cross_relation_construction, range(len(honeybuffer))), total=len(honeybuffer), desc=\"Processing honeycomb-road relationships\"):\n",
    "        relation_ls.extend(relations)\n",
    "\n",
    "# 4. 批量提交所有关系到数据库\n",
    "if relation_ls:  # 确保有关系要提交\n",
    "    subgraph = Subgraph(relationships=relation_ls)\n",
    "    tx = g.begin()\n",
    "    tx.create(subgraph)\n",
    "    g.commit(tx)\n",
    "\n",
    "# 5. 清空关系列表\n",
    "relation_ls.clear()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "baa762e4-0da8-4d3a-b943-7a3494ddb3ab",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.19"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
